A = [[4, 2, 0],
     [1, 3, 2],
     [-1, 3, 10]]

# Міняємо перший та другий рядки місцями
A[0], A[1] = A[1], A[0]

# Додаємо до другого рядка перший помножений на -4
A[1] = [A[1][i] - 4*A[0][i] for i in range(len(A[0]))]

# Додаємо до третього рядка перший рядок
A[2] = [A[2][i] + A[0][i] for i in range(len(A[0]))]

# Ділимо другий рядок на -2
A[1] = [-0.5*A[1][i] for i in range(len(A[1]))]

# Ділимо третій рядок на 6
A[2] = [A[2][i]/6 for i in range(len(A[2]))]

# Міняємо другий та третій рядки місцями
A[1], A[2] = A[2], A[1]

# Додаємо до третього рядка другий помножений на -5
A[2] = [A[2][i] - 5*A[1][i] for i in range(len(A[1]))]

print(A)
